const wordsByCategory = [{
  label: "月の名前（12）",
  words: [
    "睦月", "如月", "弥生", "卯月", "皐月", "水無月",
    "文月", "葉月", "長月", "神無月", "霜月", "師走",
    "むつき", "きさらぎ", "やよい", "うづき", "さつき", "みなづき",
    "ふみづき", "ふづき", "はづき", "ながつき", "かんなづき", "しもつき", "しわす",
    "January", "February", "March", "April", "May", "June",
    "July", "August", "September", "October", "November", "December",
  ],
}, {
  label: "六曜（6）",
  words: [
    "先勝", "友引", "先負", "仏滅", "大安", "赤口",
    "せんしょう", "ともびき", "せんぶ", "ぶつめつ", "たいあん", "しゃっこう",
  ],
}, {
  label: "ジャンケンの手（3）",
  words: [
    "グー", "チョキ", "パー",
  ],
}, {
  label: "季節（4）",
  words: [
    "春", "夏", "秋", "冬",
    "はる", "なつ", "あき", "ふゆ",
    "しゅん", "か", "しゅう", "とう",
  ],
}, {
  label: "方角（4）",
  words: [
    "東", "西", "南", "北",
    "ひがし", "にし", "みなみ", "きた",
    "とう", "ざい", "なん", "ぼく",
  ],
}, {
  label: "四国の県（4）",
  words: [
    "愛媛", "香川", "高知", "徳島",
    "えひめ", "かがわ", "こうち", "とくしま",
  ],
}, {
  label: "四国の県庁所在地（4）",
  words: [
    "松山", "高松", "高知", "徳島",
    "まつやま", "たかまつ", "こうち", "とくしま",
  ],
}, {
  label: "トランプのマーク（4）",
  words: [
    "スペード", "ハート", "ダイヤ", "クラブ",
  ],
}, {
  label: "指（5）",
  words: [
    "親指", "人差し指", "中指", "薬指", "小指",
    "おやゆび", "ひとさしゆび", "なかゆび", "くすりゆび", "こゆび",
  ],
}, {
  label: "五感（5）",
  words: [
    "視覚", "聴覚", "嗅覚", "味覚", "触覚",
    "しかく", "ちょうかく", "きゅうかく", "みかく", "しょっかく",
  ],
}, {
  label: "曜日（7）",
  words: [
    "日", "月", "火", "水", "木", "金", "土",
    "にち", "げつ", "か", "すい", "もく", "きん", "ど",
    "Sunday", "Monday", "Tuesday", "Wednesday", "Thursday", "Friday", "Saturday",
  ],
}, {
  label: "春の七草（7）",
  words: [
    "せり", "なずな", "ごぎょう", "はこべら", "ほとけのざ", "すずな", "すずしろ",
  ],
}, {
  label: "秋の七草（7）",
  words: [
    "はぎ", "すすき", "ききょう", "なでしこ", "くず", "ふじばかま", "おみなえし",
  ],
}, {
  label: "十二支（12）",
  words: [
    "子", "丑", "寅", "卯", "辰", "巳", "午", "未", "申", "酉", "戌", "亥",
    "ね", "うし", "とら", "う", "たつ", "み", "うま", "ひつじ", "さる", "とり", "いぬ", "い",
  ],
}, {
  label: "十二星座（12）",
  words: [
    "牡羊座", "牡牛座", "双子座", "蟹座", "獅子座", "乙女座",
    "天秤座", "蠍座", "射手座", "山羊座", "水瓶座", "魚座",
    "おひつじざ", "おうしざ", "ふたござ", "かにざ", "ししざ", "おとめざ",
    "てんびんざ", "さそりざ", "いてざ", "やぎざ", "みずがめざ", "うおざ",
  ],
}, {
  label: "九九っぽい言葉（81）",
  words: [
    "陰惨", "因子", "印紙", "院試", "インク", "西", "肉", "サザン", "蚕糸", "珊瑚",
    "産後", "資産", "試算", "獅子", "私語", "死後", "死語", "誤算", "午後", "語録",
    "語句", "ロック", "葉っぱ", "国", "串", "櫛", "駆使",
    "いんさん", "いんし", "いんく", "にし", "にく", "さざん", "さんし", "さんご",
    "しさん", "しし", "しご", "ごさん", "ごご", "ごろく", "ごっく", "ろっく",
    "はっぱ", "くに", "くし",
  ],
}];

export const data = wordsByCategory.flatMap((category, i) => (
  category.words.map((word, j) => (
    { id: i * 1000 + j, key: word, value: category.label }
  ))
));
